slides/emcpp-lambda/index.org
#+STARTUP: showeverything hidestars
#+TITLE: Modern Effective C++ Item 31 & 32
#+AUTHOR: Ting-Yu Lin
#+EMAIL: tlin@mozilla.com
#+DATE: October 21, 2015

#+OPTIONS: reveal_history:t
#+OPTIONS: H:2 toc:nil num:nil ^:{}
#+REVEAL_HLEVEL: 1
#+REVEAL_SPEED: fast
#+REVEAL_TRANS: fade
#+REVEAL_THEME: black
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_EXTRA_CSS: override.css

* Prelude
** Background of anonymous functions (lambda)
- Anonymous functions originate in the work of Alonzo Church in his invention of
  the lambda calculus in 1936. [[https://en.wikipedia.org/wiki/Anonymous_function][Wikipedia]]
- Lisp in 1958 uses keyword *lambda* to declare anonymous functions.
#+BEGIN_SRC lisp
  (lambda (x y) (+ x y))
#+END_SRC
- Ubiquitous in functional programming languages and other languages with
  first-class functions.

** Anonymous functions in C++
- C++ introduced *lambda* in C++11
- "Lambdas make the existing STL algorithms roughly 100x more usable" by [[http://herbsutter.com/elements-of-modern-c-style/][Herb Sutter]].

** Write a function to print elements in a STL container (C++98)
#+BEGIN_SRC C++
  template <typename Container>
  void print_container(const Container& v)
  {
    struct Printer {
      void operator()(const typename Container::value_type& n) const
      {
        cout << n << endl;
      }
    };

    for_each(v.begin(), v.end(), Printer());
  }
#+END_SRC
- You could use a functor to define a local function, but it is not convenient
  to do so.

** Write a function to print elements in a STL container (C++11)
#+BEGIN_SRC C++
  template <typename Container>
  void print_container(const Container& v)
  {
    for_each(begin(v), end(v),
             [] (const decltype(*begin(v))& n) { cout << n << endl; });
  }
#+END_SRC

** Write a function to print elements in a STL container (C++14)
- C++14 introduces /generalized lambda/.
#+BEGIN_SRC C++
  template <typename Container>
  void print_container(const Container& v)
  {
    for_each(begin(v), end(v),
             [] (const auto& n) { cout << n << endl; });
  }
#+END_SRC

** Definition
- /lambda expression/: an expression, part of the source code. (compile time)
#+BEGIN_HTML
<pre>
for_each(begin(v), end(v),
         <em>[] (const auto& n) { cout << n << endl; }</em>);
</pre>
#+END_HTML
- /closure/: the runtime object created by a lambda. Third argument of above
  code. (runtime)
- /closure class/: a class from which a closure is instantiated. (compile time)

** Lambda syntax
#+BEGIN_HTML
<pre>
[ capture-list ] ( params ) <b>mutable</b> <i>exception attribute</i> -> ret { body }
[ capture-list ] ( params ) -> ret { body }
[ capture-list ] ( params ) { body }
[ capture-list ] { body }
</pre>
#+END_HTML
- ~[]~: capture nothing
- ~[=]~: capture all /automatic/ variables used by *value* (default capture mode)
- ~[&]~: capture all /automatic/ variables used by *reference* (default capture mode)
- ~[a, &b]~: capture ~a~ by value and ~b~ by reference

* Item 31: Avoid default capture modes
- Do not use ~[=]~ and ~[&]~.
** Things to remember
- Default by-reference capture can lead to dangling references.
- Default by-value capture is susceptible to dangling pointers (especially
  *this*), and it misleadingly suggests that lambdas are self-contained.

** Define FilterContainer
#+BEGIN_SRC C++
  using FilterContainer =                     // see Item 9 for
    std::vector<std::function<bool(int)>>;    // "using", Item 5
                                              // for std::function

  FilterContainer filters;                    // filtering funcs

  filters.emplace_back(                       // see Item 42 for
    [](int value) { return value % 5 == 0; }  // info on
  );                                          // emplace_back
#+END_SRC

