slides/emcpp-lambda/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Modern Effective C++ Item 31 &amp; 32</title>
<meta name="author" content="(Ting-Yu Lin)"/>
<link rel="stylesheet" href="../reveal.js/css/reveal.css"/>
<link rel="stylesheet" href="../reveal.js/css/theme/black.css" id="theme"/>
<link rel="stylesheet" href="override.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Modern Effective C++ Item 31 &amp; 32</h1>
<h2>Ting-Yu Lin</h2>
<h2><a href="mailto:tlin@mozilla.com">tlin@mozilla.com</a></h2>
<h2>October 21, 2015</h2>
</section>

<section>
<section id="slide-orgheadline8">
<h2 id="orgheadline8">Prelude</h2>
<div class="outline-text-2" id="text-orgheadline8">
</div></section>
<section id="slide-orgheadline1">
<h3 id="orgheadline1">Background of anonymous functions (lambda)</h3>
<ul>
<li>Anonymous functions originate in the work of Alonzo Church in his invention of
the lambda calculus in 1936. <a href="https://en.wikipedia.org/wiki/Anonymous_function">Wikipedia</a></li>
<li>Lisp in 1958 uses keyword <b>lambda</b> to declare anonymous functions.</li>

</ul>
<div class="org-src-container">

<pre  class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #BFEBBF;">(</span>x y<span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">(</span>+ x y<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
<ul>
<li>Ubiquitous in functional programming languages and other languages with
first-class functions.</li>

</ul>

</section>
<section id="slide-orgheadline2">
<h3 id="orgheadline2">Anonymous functions in C++</h3>
<ul>
<li>C++ introduced <b>lambda</b> in C++11</li>
<li>"Lambdas make the existing STL algorithms roughly 100x more usable" by <a href="http://herbsutter.com/elements-of-modern-c-style/">Herb Sutter</a>.</li>

</ul>

</section>
<section id="slide-orgheadline3">
<h3 id="orgheadline3">Write a function to print elements in a STL container (C++98)</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">template</span> <span style="color: #DCDCCC;">&lt;</span><span style="color: #F0DFAF; font-weight: bold;">typename</span> <span style="color: #7CB8BB;">Container</span><span style="color: #DCDCCC;">&gt;</span>
<span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">print_container</span><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">Container</span>&amp; <span style="color: #DFAF8F;">v</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">Printer</span> <span style="color: #BFEBBF;">{</span>
    <span style="color: #7CB8BB;">void</span> <span style="color: #F0DFAF; font-weight: bold;">operator</span><span style="color: #D0BF8F;">()</span><span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #F0DFAF; font-weight: bold;">typename</span> <span style="color: #BFEBBF;">Container</span>::<span style="color: #7CB8BB;">value_type</span>&amp; <span style="color: #DFAF8F;">n</span><span style="color: #D0BF8F;">)</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>
    <span style="color: #D0BF8F;">{</span>
      cout &lt;&lt; n &lt;&lt; endl;
    <span style="color: #D0BF8F;">}</span>
  <span style="color: #BFEBBF;">}</span>;

  for_each<span style="color: #BFEBBF;">(</span>v.begin<span style="color: #D0BF8F;">()</span>, v.end<span style="color: #D0BF8F;">()</span>, Printer<span style="color: #D0BF8F;">()</span><span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
<ul>
<li>You could use a functor to define a local function, but it is not convenient
to do so.</li>

</ul>

</section>
<section id="slide-orgheadline4">
<h3 id="orgheadline4">Write a function to print elements in a STL container (C++11)</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">template</span> <span style="color: #DCDCCC;">&lt;</span><span style="color: #F0DFAF; font-weight: bold;">typename</span> <span style="color: #7CB8BB;">Container</span><span style="color: #DCDCCC;">&gt;</span>
<span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">print_container</span><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">Container</span>&amp; <span style="color: #DFAF8F;">v</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  for_each<span style="color: #BFEBBF;">(</span>begin<span style="color: #D0BF8F;">(</span>v<span style="color: #D0BF8F;">)</span>, end<span style="color: #D0BF8F;">(</span>v<span style="color: #D0BF8F;">)</span>,
           <span style="color: #D0BF8F;">[]</span> <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">decltype</span><span style="color: #93E0E3;">(</span>*<span style="color: #DFAF8F;">begin</span><span style="color: #9FC59F;">(</span>v<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>&amp; n<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span> cout &lt;&lt; n &lt;&lt; endl; <span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

</section>
<section id="slide-orgheadline5">
<h3 id="orgheadline5">Write a function to print elements in a STL container (C++14)</h3>
<ul>
<li>C++14 introduces <i>generalized lambda</i>.</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">template</span> <span style="color: #DCDCCC;">&lt;</span><span style="color: #F0DFAF; font-weight: bold;">typename</span> <span style="color: #7CB8BB;">Container</span><span style="color: #DCDCCC;">&gt;</span>
<span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">print_container</span><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">Container</span>&amp; <span style="color: #DFAF8F;">v</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  for_each<span style="color: #BFEBBF;">(</span>begin<span style="color: #D0BF8F;">(</span>v<span style="color: #D0BF8F;">)</span>, end<span style="color: #D0BF8F;">(</span>v<span style="color: #D0BF8F;">)</span>,
           <span style="color: #D0BF8F;">[]</span> <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #F0DFAF; font-weight: bold;">auto</span>&amp; n<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span> cout &lt;&lt; n &lt;&lt; endl; <span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

</section>
<section id="slide-orgheadline6">
<h3 id="orgheadline6">Definition</h3>
<ul>
<li><i>lambda expression</i>: an expression, part of the source code. (compile time)</li>

</ul>
<pre>
for_each(begin(v), end(v),
         <em>[] (T n) { cout < n < endl; }</em>);
</pre>
<ul>
<li><i>closure</i>: the runtime object created by a lambda. Third argument of above
code.(runtime)</li>
<li><i>closure class</i>: a class from which a closure is instantiated. (compile time)</li>

</ul>

</section>
<section id="slide-orgheadline7">
<h3 id="orgheadline7">Lambda syntax</h3>
<pre>
[ capture-list ] ( params ) <b>mutable</b> <i>exception attribute</i> -> ret { body }
[ capture-list ] ( params ) -> ret { body }
[ capture-list ] ( params ) { body }
[ capture-list ] { body }
</pre>
<ul>
<li><code>[]</code>: capture nothing</li>
<li><code>[=]</code>: capture all automatic variables by <b>value</b> (default capture mode)</li>
<li><code>[&amp;]</code>: capture all automatic variables by <b>reference</b> (default capture mode)</li>
<li><code>[a, &amp;b]</code>: capture <code>a</code> by value and <code>b</code> by reference</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgheadline21">
<h2 id="orgheadline21">Item 31: Avoid default capture modes</h2>
<ul>
<li>Do no use <code>[=]</code> and <code>[&amp;]</code>.</li>

</ul>
</section>
<section id="slide-orgheadline9">
<h3 id="orgheadline9">Things to Remember</h3>
<ul>
<li>Default by-reference capture can lead to dangling references.</li>
<li>Default by-value capture is susceptible to dangling pointers (especially
<b>this</b>), and it misleadingly suggests that lambdas are self-contained.</li>

</ul>

</section>
<section id="slide-orgheadline10">
<h3 id="orgheadline10">Define FilterContainer</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">using</span> <span style="color: #7CB8BB;">FilterContainer</span> =                     <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">see Item 9 for</span>
  <span style="color: #BFEBBF;">std</span>::vector&lt;<span style="color: #BFEBBF;">std</span>::function&lt;<span style="color: #7CB8BB;">bool</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB;">int</span><span style="color: #DCDCCC;">)</span>&gt;&gt;;    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">"using", Item 5</span>
                                            <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">for std::function</span>

<span style="color: #7CB8BB;">FilterContainer</span> <span style="color: #DFAF8F;">filters</span>;                    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">filtering funcs</span>

filters.emplace_back<span style="color: #DCDCCC;">(</span>                       <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">see Item 42 for</span>
  <span style="color: #BFEBBF;">[](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % 5 == 0; <span style="color: #BFEBBF;">}</span>  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">info on</span>
<span style="color: #DCDCCC;">)</span>;                                          <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">emplace_back</span>
</pre>
</div>

</section>
