slides/emcpp-lambda/index.org
** Default by-reference capture pitfalls
#+BEGIN_SRC C++
  void addFilter()
  {
    auto calc1 = computeSomeValue1();
    auto calc2 = computeSomeValue2();
    auto divisor = computeDivisor(calc1, calc2);

    filters.emplace_back(                              // danger!
      [&](int value) { return value % divisor == 0; }  // ref to
    );                                                 // divisor
  }                                                    // will
                                                       // dangle!
#+END_SRC

** How about make the by-reference capture explicit?
#+BEGIN_SRC C++
  filters.emplace_back(
    [&divisor](int value)                // danger! ref to
    { return value % divisor == 0; }     // divisor will
  );                                     // still dangle!
#+END_SRC
- Make sure your by-reference captures do not outlive your closure. Explicit
  naming the capture could make reviewing or refactoring in the future easier.

** Correct solution
#+BEGIN_SRC C++
  void addFilter()
  {
    auto calc1 = computeSomeValue1();
    auto calc2 = computeSomeValue2();
    auto divisor = computeDivisor(calc1, calc2);

    filters.emplace_back(                                 // now
      [=](int value) { return value % divisor == 0; }     // divisor
    );                                                    // can't
  }                                                       // dangle!
#+END_SRC
#+BEGIN_SRC C++
  filters.emplace_back(                                      // Might be
    [divisor](int value) { return value % divisor == 0; }    // better
  );
#+END_SRC

** How about addFilter() as a member function?
#+BEGIN_SRC C++
  class Widget {
  public:
    …                                  // ctors, etc.
    void addFilter() const;            // add an entry to filters

  private:
    int divisor;                       // used in Widget's filter
  };

  void Widget::addFilter() const
  {
    filters.emplace_back(
      [=](int value) { return value % divisor == 0; }
    );
  }
#+END_SRC

** Bang! Divisor is not captured
#+BEGIN_SRC C++
  void Widget::addFilter() const
  {
    filters.emplace_back(
      [divisor](int value)                // error! no local
      { return value % divisor == 0; }    // divisor to capture
    );
  }
#+END_SRC

** What compiler does is ...
#+BEGIN_SRC C++
void Widget::addFilter() const
{
  filters.emplace_back(
    [=](int value) { return value % divisor == 0; }
  );
}
#+END_SRC
#+BEGIN_SRC C++
  void Widget::addFilter() const
  {
    auto currentObjectPtr = this;

    filters.emplace_back(
      [currentObjectPtr](int value)
      { return value % currentObjectPtr->divisor == 0; }
    );
  }
#+END_SRC

** Correct solution
#+BEGIN_SRC C++
  void Widget::addFilter() const
  {
    auto divisorCopy = divisor;                // copy data member

    filters.emplace_back(
      [=](int value)                           // capture the copy
      { return value % divisorCopy == 0; }     // use the copy
    );
  }
#+END_SRC
- Make divisor its own life time instead of depending on Widget's life time.

