slides/emcpp-lambda/index.html
<section id="slide-orgheadline11">
<h3 id="orgheadline11">Default by-reference capture pitfalls</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">addFilter</span><span style="color: #DCDCCC;">()</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">calc1</span> = computeSomeValue1<span style="color: #BFEBBF;">()</span>;
  <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">calc2</span> = computeSomeValue2<span style="color: #BFEBBF;">()</span>;
  <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">divisor</span> = computeDivisor<span style="color: #BFEBBF;">(</span>calc1, calc2<span style="color: #BFEBBF;">)</span>;

  filters.emplace_back<span style="color: #BFEBBF;">(</span>                              <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">danger!</span>
    <span style="color: #D0BF8F;">[</span>&amp;<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #D0BF8F;">}</span>  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">ref to</span>
  <span style="color: #BFEBBF;">)</span>;                                                 <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">divisor</span>
<span style="color: #DCDCCC;">}</span>                                                    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">will</span>
                                                     <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">dangle!</span>
</pre>
</div>

</section>
<section id="slide-orgheadline12">
<h3 id="orgheadline12">How about make the by-reference capture explicit?</h3>
<div class="org-src-container">

<pre  class="src src-C++">filters.emplace_back<span style="color: #DCDCCC;">(</span>
  <span style="color: #BFEBBF;">[</span>&amp;divisor<span style="color: #BFEBBF;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #BFEBBF;">)</span>                <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">danger! ref to</span>
  <span style="color: #BFEBBF;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #BFEBBF;">}</span>     <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">divisor will</span>
<span style="color: #DCDCCC;">)</span>;                                     <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">still dangle!</span>
</pre>
</div>
<ul>
<li>Make sure your by-reference captures do not outlive your closure. Explicit
naming the capture could make reviewing or refactoring in the future easier.</li>

</ul>

</section>
<section id="slide-orgheadline13">
<h3 id="orgheadline13">Correct solution</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">addFilter</span><span style="color: #DCDCCC;">()</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">calc1</span> = computeSomeValue1<span style="color: #BFEBBF;">()</span>;
  <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">calc2</span> = computeSomeValue2<span style="color: #BFEBBF;">()</span>;
  <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">divisor</span> = computeDivisor<span style="color: #BFEBBF;">(</span>calc1, calc2<span style="color: #BFEBBF;">)</span>;

  filters.emplace_back<span style="color: #BFEBBF;">(</span>                                 <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">now</span>
    <span style="color: #D0BF8F;">[</span>=<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #D0BF8F;">}</span>     <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">divisor</span>
  <span style="color: #BFEBBF;">)</span>;                                                    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">can't</span>
<span style="color: #DCDCCC;">}</span>                                                       <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">dangle!</span>
</pre>
</div>
<div class="org-src-container">

<pre  class="src src-C++">filters.emplace_back<span style="color: #DCDCCC;">(</span>                                      <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Might be</span>
  <span style="color: #BFEBBF;">[</span>divisor<span style="color: #BFEBBF;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #BFEBBF;">}</span>    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">better</span>
<span style="color: #DCDCCC;">)</span>;
</pre>
</div>

</section>
<section id="slide-orgheadline14">
<h3 id="orgheadline14">How about addFilter() as a member function?</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Widget</span> <span style="color: #DCDCCC;">{</span>
<span style="color: #F0DFAF; font-weight: bold;">public</span>:
  &#8230;                                  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">ctors, etc.</span>
  <span style="color: #7CB8BB;">void</span> addFilter<span style="color: #BFEBBF;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>;            <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">add an entry to filters</span>

<span style="color: #F0DFAF; font-weight: bold;">private</span>:
  <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">divisor</span>;                       <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">used in Widget's filter</span>
<span style="color: #DCDCCC;">}</span>;

<span style="color: #7CB8BB;">void</span> <span style="color: #BFEBBF;">Widget</span>::<span style="color: #93E0E3;">addFilter</span><span style="color: #DCDCCC;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>
<span style="color: #DCDCCC;">{</span>
  filters.emplace_back<span style="color: #BFEBBF;">(</span>
    <span style="color: #D0BF8F;">[</span>=<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #D0BF8F;">}</span>
  <span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

</section>
<section id="slide-orgheadline15">
<h3 id="orgheadline15">Bang! Divisor is not captured</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #7CB8BB;">void</span> <span style="color: #BFEBBF;">Widget</span>::<span style="color: #93E0E3;">addFilter</span><span style="color: #DCDCCC;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>
<span style="color: #DCDCCC;">{</span>
  filters.emplace_back<span style="color: #BFEBBF;">(</span>
    <span style="color: #D0BF8F;">[</span>divisor<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span>                <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">error! no local</span>
    <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #D0BF8F;">}</span>    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">divisor to capture</span>
  <span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

</section>
<section id="slide-orgheadline16">
<h3 id="orgheadline16">What compiler does is &#x2026;</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #7CB8BB;">void</span> <span style="color: #BFEBBF;">Widget</span>::<span style="color: #93E0E3;">addFilter</span><span style="color: #DCDCCC;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>
<span style="color: #DCDCCC;">{</span>
  filters.emplace_back<span style="color: #BFEBBF;">(</span>
    <span style="color: #D0BF8F;">[</span>=<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #D0BF8F;">}</span>
  <span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #7CB8BB;">void</span> <span style="color: #BFEBBF;">Widget</span>::<span style="color: #93E0E3;">addFilter</span><span style="color: #DCDCCC;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">currentObjectPtr</span> = <span style="color: #F0DFAF; font-weight: bold;">this</span>;

  filters.emplace_back<span style="color: #BFEBBF;">(</span>
    <span style="color: #D0BF8F;">[</span>currentObjectPtr<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % currentObjectPtr-&gt;divisor == 0; <span style="color: #D0BF8F;">}</span>
  <span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

</section>
<section id="slide-orgheadline17">
<h3 id="orgheadline17">Correct solution</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #7CB8BB;">void</span> <span style="color: #BFEBBF;">Widget</span>::<span style="color: #93E0E3;">addFilter</span><span style="color: #DCDCCC;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">divisorCopy</span> = divisor;                <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">copy data member</span>

  filters.emplace_back<span style="color: #BFEBBF;">(</span>
    <span style="color: #D0BF8F;">[</span>=<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span>                           <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">capture the copy</span>
    <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisorCopy == 0; <span style="color: #D0BF8F;">}</span>     <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">use the copy</span>
  <span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
<ul>
<li>Make divisor its own life time instead of depending on Widget's life time.</li>

</ul>

</section>
