slides/emcpp-lambda/index.org
** Warning: static variables will not be captured
#+BEGIN_SRC C++
  void addDivisorFilter()
  {
    static auto calc1 = computeSomeValue1();      // now static
    static auto calc2 = computeSomeValue2();      // now static

    static auto divisor =                         // now static
      computeDivisor(calc1, calc2);

    filters.emplace_back(
      [=](int value)                     // captures nothing!
      { return value % divisor == 0; }   // refers to above static
    );

    ++divisor;                           // modify divisor
  }
#+END_SRC
- Still compiles using *[]* instead of *[=]*.

** Things to remember
- Default by-reference capture can lead to dangling references.
- Default by-value capture is susceptible to dangling pointers (especially
  *this*), and it misleadingly suggests that lambdas are self-contained.

* Item 32: Use init capture to move objects into closures
** Shortcoming in C++11 lambda capture
- If you have a *move-only* object (e.g., a std::unique_ptr), you cannot get it
  into a closure in C++11.
- C++14 resolve this by init capture (a.k.a. generalized lambda captures). You
  have to specify:
  1. *the name of a data member* in the closure class generated from the lambda and
  2. *an expression* initializing that data member.

** Widget::addFilter() in C++14
- C++11
#+BEGIN_SRC C++
  void Widget::addFilter() const
  {
    auto divisorCopy = divisor;                // copy data member

    filters.emplace_back(
      [=](int value)                           // capture the copy
      { return value % divisorCopy == 0; }     // use the copy
    );
  }
#+END_SRC
- Use generalized lambda capture in C++14
#+BEGIN_SRC C++
  void Widget::addFilter() const
  {
    filters.emplace_back(               // C++14:
      [divisor = divisor](int value)    // copy divisor to closure
      { return value % divisor == 0; }  // use the copy
    );
  }
#+END_SRC

** Example: init capture
#+BEGIN_SRC C++
class Widget {                          // some useful type
public:

  bool isValidated() const;
  bool isProcessed() const;
  bool isArchived() const;

private:
  …
};


auto pw = std::make_unique<Widget>();   // create Widget; see
                                        // Item 21 for info on
                                        // std::make_unique

…                                       // configure *pw

auto func = [pw = std::move(pw)]               // init data mbr
            { return pw->isValidated()         // in closure w/
                     && pw->isArchived(); };   // std::move(pw)
#+END_SRC

** Example: init capture
#+BEGIN_SRC C++
  auto func = [pw = std::make_unique<Widget>()]  // init data mbr
              { return pw->isValidated()         // in closure w/
                       && pw->isArchived(); };   // result of call
                                                 // to make_unique
#+END_SRC

** Example: move capture in C++14
#+BEGIN_HTML
<pre>
<em>std::vector&lt;double&gt; data;</em>                 // object to be moved
                                          // into closure

…                                         // populate data

auto func = [<em>data = std::move(data)</em>]      // C++14 init capture
            { /* uses of data */ };
</pre>
#+END_HTML

** Example: emulate move capture in C++11
#+BEGIN_HTML
<pre>
std::vector&lt;double&gt; data;                 // as above

…                                         // as above

auto func =
  std::bind(                              // C++11 emulation
    [](<em>const std::vector&lt;double&gt;</em>& <em>data</em>)   // of init capture
    { /* uses of data */ },
    <em>std::move(data)</em>
  );
</pre>
#+END_HTML
- ~std::bind()~
  - First argument: callable object
  - Subsequent arguments: lvalues are copy constructed; rvalues are move constructed.

** Example: emulate move capture of mutable lambda in C++11
#+BEGIN_HTML
<pre>
auto func =
  std::bind(                               // C++11 emulation
    [](<em>std::vector&lt;double&gt;</em>& data) <em>mutable</em>  // of init capture
    { /* uses of data */ },                // for mutable lambda
    std::move(data)
  );
</pre>
#+END_HTML

** Example: emulate move capture in C++11 (2)
#+BEGIN_HTML
<pre>
auto func = [<em>pw</em> = <em>std::make_unique&lt;Widget&gt;()</em>]    // as before,
            { return pw-&gt;isValidated()           // create pw
                     && pw-&gt;isArchived(); };     // in closure
</pre>
#+END_HTML
#+BEGIN_HTML
<pre>
auto func = std::bind(
              [](<em>const std::unique_ptr&lt;Widget&gt;</em>& <em>pw</em>)
              { return pw-&gt;isValidated()
                     && pw-&gt;isArchived(); },
              <em>std::make_unique&lt;Widget&gt;()</em>
            );
</pre>
#+END_HTML
- Spoiler: Item 34: Prefer lambdas to ~std::bind~.

