slides/emcpp-lambda/index.html
<section id="slide-orgheadline18">
<h3 id="orgheadline18">Correct solution (C++14)</h3>
<ul>
<li>Use generalized lambda capture (Item 32).</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #7CB8BB;">void</span> <span style="color: #BFEBBF;">Widget</span>::<span style="color: #93E0E3;">addFilter</span><span style="color: #DCDCCC;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>
<span style="color: #DCDCCC;">{</span>
  filters.emplace_back<span style="color: #BFEBBF;">(</span>               <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">C++14:</span>
    <span style="color: #D0BF8F;">[</span>divisor = divisor<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span>    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">copy divisor to closure</span>
    <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #D0BF8F;">}</span>  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">use the copy</span>
  <span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

</section>
<section id="slide-orgheadline19">
<h3 id="orgheadline19">Warning: static variables will not be captured</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">addDivisorFilter</span><span style="color: #DCDCCC;">()</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">calc1</span> = computeSomeValue1<span style="color: #BFEBBF;">()</span>;      <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">now static</span>
  <span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">calc2</span> = computeSomeValue2<span style="color: #BFEBBF;">()</span>;      <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">now static</span>

  <span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">divisor</span> =                         <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">now static</span>
    computeDivisor<span style="color: #BFEBBF;">(</span>calc1, calc2<span style="color: #BFEBBF;">)</span>;

  filters.emplace_back<span style="color: #BFEBBF;">(</span>
    <span style="color: #D0BF8F;">[</span>=<span style="color: #D0BF8F;">](</span><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">value</span><span style="color: #D0BF8F;">)</span>                     <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">captures nothing!</span>
    <span style="color: #D0BF8F;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> value % divisor == 0; <span style="color: #D0BF8F;">}</span>   <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">refers to above static</span>
  <span style="color: #BFEBBF;">)</span>;

  ++divisor;                           <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">modify divisor</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
<ul>
<li>Still compiles using <b>[]</b> instead of <b>[=]</b>.</li>

</ul>

</section>
<section id="slide-orgheadline20">
<h3 id="orgheadline20">Things to Remember</h3>
<ul>
<li>Default by-reference capture can lead to dangling references.</li>
<li>Default by-value capture is susceptible to dangling pointers (especially
<b>this</b>), and it misleadingly suggests that lambdas are self-contained.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgheadline30">
<h2 id="orgheadline30">Item 32: Use init capture to move objects into closures</h2>
<div class="outline-text-2" id="text-orgheadline30">
</div></section>
<section id="slide-orgheadline22">
<h3 id="orgheadline22">Shortcoming in C++11 lambda capture</h3>
<ul>
<li>If you have a <b>move-only</b> object (e.g., a std::unique_ptr), you cannot get it
into a closure in C++11.</li>
<li>C++14 resolve this by init capture (a.k.a. generalized lambda captures). You
have to specify:
<ol>
<li><b>the name of a data member</b> in the closure class generated from the lambda and</li>
<li><b>an expression</b> initializing that data member.</li>

</ol></li>

</ul>

</section>
<section id="slide-orgheadline23">
<h3 id="orgheadline23">Example: init capture</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Widget</span> <span style="color: #DCDCCC;">{</span>                          <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">some useful type</span>
<span style="color: #F0DFAF; font-weight: bold;">public</span>:

  <span style="color: #7CB8BB;">bool</span> <span style="color: #93E0E3;">isValidated</span><span style="color: #BFEBBF;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>;
  <span style="color: #7CB8BB;">bool</span> <span style="color: #93E0E3;">isProcessed</span><span style="color: #BFEBBF;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>;
  <span style="color: #7CB8BB;">bool</span> <span style="color: #93E0E3;">isArchived</span><span style="color: #BFEBBF;">()</span> <span style="color: #F0DFAF; font-weight: bold;">const</span>;

<span style="color: #F0DFAF; font-weight: bold;">private</span>:
  &#8230;
<span style="color: #DCDCCC;">}</span>;


<span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">pw</span> = <span style="color: #BFEBBF;">std</span>::<span style="color: #7CB8BB;">make_unique</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #7CB8BB;">Widget</span><span style="color: #DCDCCC;">&gt;()</span>;   <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">create Widget; see</span>
                                        <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Item 21 for info on</span>
                                        <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">std::make_unique</span>

&#8230;                                       <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">configure *pw</span>

<span style="color: #F0DFAF; font-weight: bold;">auto</span> func = <span style="color: #DCDCCC;">[</span>pw = <span style="color: #BFEBBF;">std</span>::move<span style="color: #BFEBBF;">(</span>pw<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">]</span>               <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">init data mbr</span>
            <span style="color: #DCDCCC;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> pw-&gt;isValidated<span style="color: #BFEBBF;">()</span>         <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">in closure w/</span>
                     &amp;&amp; pw-&gt;isArchived<span style="color: #BFEBBF;">()</span>; <span style="color: #DCDCCC;">}</span>;   <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">std::move(pw)</span>
</pre>
</div>

</section>
<section id="slide-orgheadline24">
<h3 id="orgheadline24">Example: init capture</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">auto</span> <span style="color: #7CB8BB;">func</span> = <span style="color: #DCDCCC;">[</span>pw = <span style="color: #BFEBBF;">std</span>::<span style="color: #7CB8BB;">make_unique</span><span style="color: #BFEBBF;">&lt;</span>Widget<span style="color: #BFEBBF;">&gt;()</span><span style="color: #DCDCCC;">]</span>  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">init data mbr</span>
            <span style="color: #DCDCCC;">{</span> <span style="color: #F0DFAF; font-weight: bold;">return</span> pw-&gt;isValidated<span style="color: #BFEBBF;">()</span>         <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">in closure w/</span>
                     &amp;&amp; pw-&gt;isArchived<span style="color: #BFEBBF;">()</span>; <span style="color: #DCDCCC;">}</span>;   <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">result of call</span>
                                               <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">to make_unique</span>
</pre>
</div>

</section>
<section id="slide-orgheadline25">
<h3 id="orgheadline25">Example: move capture in C++14</h3>
<pre>
<em>std::vector&lt;double&gt; data;</em>                 // object to be moved
                                          // into closure

…                                         // populate data

auto func = [<em>data = std::move(data)</em>]      // C++14 init capture
            { /* uses of data */ };
</pre>

</section>
<section id="slide-orgheadline26">
<h3 id="orgheadline26">Example: emulate move capture in C++11</h3>
<pre>
std::vector&lt;double&gt; data;                 // as above

…                                         // as above

auto func =
  std::bind(                              // C++11 emulation
    [](<em>const std::vector&lt;double&gt;</em>& <em>data</em>)   // of init capture
    { /* uses of data */ },
    <em>std::move(data)</em>
  );
</pre>
<ul>
<li><code>std::bind()</code>
<ul>
<li>First argument: callable object</li>
<li>Subsequent arguments: lvalues are copy constructed; rvalues are move constructed.</li>

</ul></li>

</ul>

</section>
<section id="slide-orgheadline27">
<h3 id="orgheadline27">Example: emulate move capture of mutable lambda in C++11</h3>
<pre>
auto func =
  std::bind(                               // C++11 emulation
    [](<em>std::vector&lt;double&gt;</em>& data) <em>mutable</em>  // of init capture
    { /* uses of data */ },                // for mutable lambda
    std::move(data)
  );
</pre>

</section>
<section id="slide-orgheadline28">
<h3 id="orgheadline28">Example: emulate move capture in C++11 (2)</h3>
<pre>
auto func = [<em>pw</em> = <em>std::make_unique&lt;Widget&gt;()</em>]    // as before,
            { return pw-&gt;isValidated()           // create pw
                     && pw-&gt;isArchived(); };     // in closure
</pre>
<pre>
auto func = std::bind(
              [](<em>const std::unique_ptr&lt;Widget&gt;</em>& <em>pw</em>)
              { return pw-&gt;isValidated()
                     && pw-&gt;isArchived(); },
              <em>std::make_unique&lt;Widget&gt;()</em>
            );
</pre>
<ul>
<li>Spoiler: Item 34: Prefer lambdas to <code>std::bind</code>.</li>

</ul>

</section>
